Revit 2027 API
GroupTypeId.Fitting Property
 Fittings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Fitting { get; }
Public Shared ReadOnly Property Fitting As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Fitting {
	ForgeTypeId^ get ();
}
static member Fitting : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace